import telebot
from datetime import datetime, timedelta

token = "510170979:AAFBA-h6uxzxCx-5TXWpW52YZ7fKvUd9F5Q"
bot = telebot.TeleBot(token)
#chat_id = 352354383

table = {10: "\u2705 Понедельник(четная)\n\n\u23F01 пара (9:00-10:35)\nЛекция:Ист.русск.литературы\nКабинет:2501\n"
             "Преподаватель:Евдокимова Е.А\n\n"
            "\u23F02 пара (11:45-12:20)\nФиз-ра\n\n"
            "\u23F03 пара (13:00-14:35)\nПрактика:Ин.яз в проф.сфере\nКабинет:1433\nПреподаватель:Максимова Е.Е.\n\n"
              "\u23F04 пара (14:45-16:20)\nПрактика:Философия\nКабинет:К-101\nПреподаватель:Борисов О.С.\n\n"
            "\u23F05 пара(16:30-18:05)\nПрактика:История зарубежного кино\nКабинет:1241\nПреподаватель Борисов О.С.",
         11: "\u2705 Понедельник(нечетная)\n\n\u23F01 пара (9:00-10:35)\nЛекция:Ист.русск.литературы\nКабинет:2501\n"
             "Преподаватель:Евдокимова Е.А\n\n"
             "\u23F02 пара (11:45-12:20)\nФиз-ра\n\n"
             "\u23F03 пара (13:00-14:35)\n"
             "Практика:Мастерство актера\nКабинет:2103\nПреподаватель:Шнейдер Н.В\n\n"
             "\u23F04 пара (14:45-16:20)\nПрактика:Мастерство актера\nКабинет:2103\nПреподаватель:Шнейдер Н.В\n\n",
         20: "\u2705 Вторник(четная)\n\n Можно пинать хуи\u263A",
         21: "\u2705 Вторник(нечетная)\n\n Можно пинать хуи\u263A",
         30: "\u2705 Среда(четная)\n\n\u23F04 пара (14:45-16:20)\nЛекция+практика:Теор. и практика монтажа\nКабинет:1502"
            "\nПреподаватель:Егоров Д.В\n\n\u23F05 пара (16:30-18:05)\nЛекция:Ист.заруб.кино\nКабинет:1312\n"
            "Преподаватель:Хлыстунова С.В.",
         31: "\u2705 Среда(нечетная)\n\n\u23F03 пара(13:00-14:35)\nЛекция:Философия(13:00-14:35)Кабинет:1435\n"
             "Преподаватель:Борисов О.С.\n\n\u23F04 пара (14:45-16:20)\nЛекция+практика:Теор. и практика монтажа\nКабинет:1502"
            "\nПреподаватель:Егоров Д.В\n\nu23F05 пара (16:30-18:05)\nПрактика:Ин.яз в проф.сфере\nКабинет:кафИЯ\n"
             "Преподаватель:Максимова Е.Е.",
         40: "\u2705 Четверг(четная)\n\n\u23F01 пара (9:00-10:35)\nПрактика:Ист.руск.литературы\nКабинет:1208\n"
             "Преподаватель:Евдакимова Е.А.\n\n"
            "\u23F02 пара (11:45-12:20)\nЛекция+практика:Изоб.решение анимац.фильма\nКабинет:1502\n"
             "Преподаватель:Воропай Г.В.\n\n"
             "\u23F03 пара (13:00-14:35)\nЛекция+практика:Анимация(мультдвижения)\n"
             "Кабинет:1333\nПреподаватель:Воропай Г.В.\n\n"
             "\u23F04 пара (14:45-16:20)\nПрактика:Мастерство актера\n"
             "Кабинет:2101\nПреподаватель:Шнейдер Н.В.",

         41: "\u2705 Четверг(нечетная)\n\n\u23F01 пара (9:00-10:35)\nПрактика:Ист.руск.литературы\nКабинет:1241\n"
             "Преподаватель:Евдакимова Е.А.\n\n"
             "\u23F02 пара (11:45-12:20)\nЛекция+практика:Изоб.решение анимац.фильма\nКабинет:1502\n"
             "Преподаватель:Воропай Г.В.\n\n\u23F03 пара (13:00-14:35)\nЛекция+практика:Анимация(мультдвижения)\n"
             "Кабинет:1333\nПреподаватель:Воропай Г.В.\n\n\u23F04 пара (14:45-16:20)\nФиз-ра\n\n"
             "\u23F05 пара (16:30-18:05)\n *1\nхз чё такое",
         50: "\u2705 Пятница(четная)\n\n\u23F02 пара (11:45-12:20)\nЛекция:Изоб.решения фильма\nКабинет:131\n"
            "Преподаватель:Шеметова М.Н.\n\n"
            "\u23F03 пара ((13:00-14:35)\nЛекция+практика:Теор.и практика комп.графики *2\n"
            "Кабинет:1334\nПреподаватель:Кальченко(лол)А.П.",
         51: "\u2705 Пятница(нечетная)\n\n\u23F03 пара ((13:00-14:35)\nЛекция+практика:Теор.и практика комп.графики *2\n"
            "Кабинет:1334\nПреподаватель:Кальченко(лол)А.П.\n\n"
            "\u23F04 пара (14:45-16:20)\nПрактика:Изоб.решение фильма\nКабинет:1311\nПреподаватель:Шеметова М.Н.\n\n",
         60: "\u2705 Суббота(четная)\n\n\u23F01 пара (9:00-10:35)\nЛекция+практика:Режессура анимац.фильма\n"
            "Кабинет:1333\nПреподаватель:Воропай Г.В.\n\n"
            "\u23F02 пара (11:45-12:20)\nПрактика:Режессура анимац.фильма\nКабинет:1333\nПреподаватель:Воропай Г.В.\n\n",
         61: "\u2705 Суббота(нечетная)\n\n\u23F01 пара (9:00-10:35)\nЛекция+практика:Режессура анимац.фильма\n"
            "Кабинет:1333\nПреподаватель:Воропай Г.В.\n\n"
            "\u23F02 пара (11:45-12:20)\nПрактика:Режессура анимац.фильма\nКабинет:1333\nПреподаватель:Воропай Г.В.\n\n"
             "\u23F03 пара (13:00-14:35)\nПрактика:Режессура анимац.фильма\nКабинет:1333\nПреподаватель:Воропай Г.В.\n\n"
             "",
         70: "\u2705 Воскресенье\nСходи в церковь",
         71: "\u2705 Воскресенье\nСходи в церковь"}


def date_counter(x):
    now = datetime.now()
    a = now.isoweekday()
    b = now.isocalendar()[1] % 2
    c = int(str(a)+str(b))
    if x == 0:
        return c
    if x == 1 and c != 70:
        return c+10
    if x == 1 and c == 70:
        return 11
    if x == 1 and c == 71:
        return 10


@bot.message_handler(commands=['start'])
def handle_start(message):
    user_markup = telebot.types.ReplyKeyboardMarkup(True, False)
    user_markup.row('сегодня', 'завтра', 'вся неделя')
    bot.send_message(message.from_user.id, 'Добро пожаловать...', reply_markup=user_markup)


@bot.message_handler(commands=['stop'])
def handle_start(message):
    hide_markup = telebot.types.ReplyKeyboardMarkup()
    bot.send_message(message.from_user.id, '...', reply_markup=hide_markup)


@bot.message_handler(content_types=['text'])
def handle_text(message):

    if message.text == 'сегодня':
        bot.send_message(message.chat.id,table[date_counter(0)])
    if message.text == 'завтра':
        bot.send_message(message.chat.id, table[date_counter(1)])
    if message.text == 'вся неделя':
        user_markup = telebot.types.ReplyKeyboardMarkup(True, True)
        user_markup.row('четная', 'нечётная', '/start')
        bot.send_message(message.from_user.id, '...', reply_markup=user_markup)
    if message.text == 'четная':
        for item in table:
            if item % 2 == 0:
                bot.send_message(message.chat.id, table[item])
    if message.text == 'нечётная':
        for item in table:
            if item % 2 != 0:
                bot.send_message(message.chat.id, table[item])


bot.polling(none_stop=True)
